[
    {
        "instance_id": "astropy__astropy-13838",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image shows a table representation with the following details: The table is labeled as 'QTable(rows=events[0])' indicating it is a table with rows from the first event of a list named 'events'. The table has a length of 3. The first column is labeled 'col0' and contains the values 'str1', 'A', 'B', and 'C'. The second column is labeled 'str1' and contains the values 'A', 'B', and 'C'. The third column is labeled 'A' and contains the values 'B' and 'C'. The fourth column is labeled 'B' and contains the values 'C'. The fifth column is labeled 'C' and contains the values '[]'. The table appears to be a representation of a structured data format, possibly from a software application or a programming environment."
            },
            {
                "image_id": "2",
                "description": "The image shows a table representation with the following details: The table is labeled as 'QTable(rows=events)' indicating it is a table with rows from a list named 'events'. The table has a length of 3. The first row contains the column headers 'A', 'B', and 'C'. The second row contains the values 'int64', 'int64', and 'object' indicating the data types of the columns. The third row contains the values '0', '0', and '[]' for the first event. The fourth row contains the values '1', '0', and '[]' for the second event. The fifth row contains the values '2', '2', and '[0 1]' for the third event. The table appears to be a representation of a structured data format, possibly from a software application or a programming environment."
            }
        ]
    },
    {
        "instance_id": "matplotlib__matplotlib-22931",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image shows a simple line plot with a single blue line that starts at the origin (0,0) and extends to the point (1,1). The x-axis ranges from 0 to 1, and the y-axis also ranges from 0 to 1. The plot is displayed in a window with a title 'Figure 1' at the top. The window includes a toolbar with various icons, such as home, back, forward, save, zoom, and others, indicating it is a graphical user interface for a plotting library, likely Matplotlib. The plot appears to be a basic example of a line plot, commonly used to demonstrate basic plotting functionality."
            }
        ]
    },
    {
        "instance_id": "matplotlib__matplotlib-24189",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image shows a plot generated by matplotlib with a mosaic layout. The mosaic consists of three sections labeled 'A', 'B', and 'C'. Section 'A' is a large square occupying the left side of the plot, with coordinates ranging from (0.0, 0.0) to (1.0, 1.0). Section 'B' is a smaller square located in the top right corner, with coordinates ranging from (0.0, 0.0) to (1.0, 1.0) for both axes. Section 'C' is another smaller square located directly below 'B', sharing the same x-axis range but with a y-axis range from (0.0, 0.0) to (1.0, 1.0). The overall layout suggests an attempt to create a nested mosaic with different width ratios, which is causing an error as described in the issue context."
            }
        ]
    },
    {
        "instance_id": "matplotlib__matplotlib-24768",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image is a polar plot created using matplotlib. It displays a color map with a grid of squares, each with a different color. The colors range from dark purple to bright yellow, with shades of green and blue in between. The plot is circular, with the x-axis ranging from -10 to 10 and the y-axis ranging from -10 to 10. The center of the plot is marked with a white circle. The plot is annotated with the text '3.7.0.dev447+g2d18bba0ea' in the center. The background of the plot is white. The plot appears to be part of a test case demonstrating the use of rasterization in matplotlib."
            }
        ]
    },
    {
        "instance_id": "mwaskom__seaborn-3276",
        "description_list": [
            {
                "image_id": "1",
                "description": "This image shows a heatmap with a color scale ranging from 0.0 to 1.0. The heatmap is divided into a grid of cells, each representing a value. The values are displayed in the cells, with a range from 0.00 to 0.10. The cells are colored according to the value, with lighter shades representing lower values and darker shades representing higher values. The heatmap is labeled with 'expected' at the top and 'predicted' at the bottom. The columns and rows are labeled with letters from A to Z and numbers from 0 to 10, respectively."
            },
            {
                "image_id": "2",
                "description": "This image shows a heatmap with a color scale ranging from 0.0 to 1.0. The heatmap is divided into a grid of cells, each representing a value. The values are displayed in the cells, with a range from 0.00 to 0.10. The cells are colored according to the value, with lighter shades representing lower values and darker shades representing higher values. The heatmap is labeled with 'expected' at the top and 'predicted' at the bottom. The columns and rows are labeled with letters from A to Z and numbers from 0 to 10, respectively."
            }
        ]
    },
    {
        "instance_id": "sphinx-doc__sphinx-11502",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image shows a note in French that translates to: 'Note: This page is not yet completely translated (progress: 95%).' This note is likely used to inform users that the content on the page is partially translated, with 95% of the translation completed. It is relevant to the feature request described in the issue, which discusses adding markers to indicate the translation status of documentation pages. The note is presented in a yellow background with a black border, suggesting it is a warning or informational message."
            }
        ]
    },
    {
        "instance_id": "sphinx-doc__sphinx-9698",
        "description_list": [
            {
                "image_id": "1",
                "description": "The image shows an index page with two entries under the letter 'B'. The first entry is 'bar() (Foo property)' and the second entry is 'baz (Foo property)'. The text is displayed in a simple, clean format with the index heading 'Index' at the top and the letter 'B' in bold below it. The entries are listed in two columns, with 'bar() (Foo property)' on the left and 'baz (Foo property)' on the right. The parentheses around 'bar()' indicate that it is a method, while the lack of parentheses around 'baz' suggests it is a property. This image is relevant to the issue as it demonstrates the incorrect formatting of the index entry for the 'bar' method, which should not have parentheses around it."
            }
        ]
    }
]